{"config": {"name": "sequential_1", "layers": [{"config": {"name": "conv2d_1", "trainable": true, "data_format": "channels_last", "activation": "relu", "use_bias": true, "kernel_constraint": null, "strides": [1, 1], "batch_input_shape": [null, 50, 50, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "padding": "valid", "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_size": [5, 5], "dtype": "float32", "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_1", "data_format": "channels_last", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "batch_normalization_1", "momentum": 0.99, "axis": -1, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "trainable": true, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "epsilon": 0.001, "center": true}, "class_name": "BatchNormalization"}, {"config": {"name": "dropout_1", "seed": null, "trainable": true, "rate": 0.5, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"name": "conv2d_2", "data_format": "channels_last", "activation": "relu", "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "strides": [1, 1], "padding": "valid", "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "filters": 16, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_size": [5, 5], "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_2", "data_format": "channels_last", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "batch_normalization_2", "momentum": 0.99, "axis": -1, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "trainable": true, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "epsilon": 0.001, "center": true}, "class_name": "BatchNormalization"}, {"config": {"name": "dropout_2", "seed": null, "trainable": true, "rate": 0.5, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "trainable": true, "activation": "relu", "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "units": 8, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dense_2", "trainable": true, "activation": "sigmoid", "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "units": 1, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null}, "class_name": "Dense"}]}, "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.4"}